//盈久客服访问配置
let preUrl=""
const YINGJIU=false
//四川184 报表
const reportrole=false
//报表图形分页
const CHART_PAGE_SIZE = 10
//页面延迟请求时间
const TIME_REQUEST=500
// 监控树形每次更新数量
const JK_PAGE_SIZE = 500
// 跳转免登陆
// const LOGINFREE = false
 // 报警类型颜色配置
const COLOR_TYPE = {
    '视频信号丢失报警': '#ffcdd3 ',
    '视频信号遮挡报警': '#f0999b',
    '存储单元故障报警': '#e94f4f',
    '其他视频设备报警': '#f61310',
    '客车超员报警': '#b71c1c',
    '异常驾驶行为报警': '#f7bbcf',
    '特殊报警达到存储阀值报警': '#f48fb1',
    '夜间禁行报警': '#e91f63',
    '翻斗升起报警': '#c2185b',
    '非法行驶报警': '#8a0d50',
    '反转报警': '#e2bde7',
    '夜间禁止上高速报警': '#ce93d9',
    '伪基站报警': '#ac47bb',
    '防劫报警': '#7b1fa2',
    '紧急报警': '#4a148d',
    'GNSS报警': '#c5cae8',
    '终端主电源掉电报警': '#a0a7dc',
    '终端故障报警': '#5d6ac0',
    '油量信号异常': '#30409f',
    '当天累计驾驶超时报警': '#1b237e',
    '非法点火报警': '#bbdffc',
    '非法位移报警': '#90caf8',
    '非法开门报警': '#2196f3',
    '非法拆除、见光报警': '#1977d2',
    '震动报警': '#0d47a1',
    '视频终端报警': '#b3ebf3',
    '低温报警': '#6ad9e7',
    '碰撞预警': '#02b5ce',
    '侧翻预警': '#0193a1',
    '危险预警': '#006064',
    '伪基站报警': '#c8e6ca',
    '模块发生故障报警': '#98d69a',
    '天线未接或被剪断报警': '#50ba53',
    '低速报警': '#388e3d',
    '超速报警': '#ff00ff',
    '道路限速超速报警': '#f1f4c3',
    '偏离线路报警': '#e0e696',
    '上线报警': '#cddc3a',
    '掉线报警': '#b0b42c',
    '停车超时报警': '#837717',
    '疲劳驾驶报警': '#fdefbb',
    '停车点火报警': '#fde68e',
    '行驶异常报警': '#fad63e',
    '点火报警': '#fbc030',
    '进区域报警': '#c58e08',
    '出区域报警': '#ffe0b0',
    '出省报警': '#ffcc80',
    '加油报警': '#ffa725',
    '漏油报警': '#fc6c1e',
    '原地设防报警': '#c24603',
    '低油量报警': '#d7e1f2',
    '围栏内超速报警': '#afc2e6',
    '围栏内停车超时报警': '#8199c5',
    '电瓶拆除报警': '#657798',
    '低电压报警': '#4a5973',
    '超温报警': '#e0e0e0',
    '无效定位报警': '#bdbdbd',
    '线路超速报警': '#747676',
    '进区域报警(软)': '#212121',
    '出区域报警(软)': '#d0d8dc',
    '超速报警(软)': '#afbec4',
    '低速报警(软)': '#5f7d8c',
    '加油报警(软)': '#455a63',
    '漏油报警(软)': '#253239',
    '低油量报警(软)': '#d6cdc9',
    '驶入线路报警(软)': '#bbaaa5',
    '停车报警超时(软)': '#8e6d63',
    '停车点火报警(软)': '#5d4138',
    '偏离线路报警(软)': '#3f2623',
    '原地设防报警(软)': '#1a5e1e',
    '停车超时报警(软)': '#f6f6f6',
    '围栏内超速报警(软)': '#164a84',
    '驶入线路报警':'#fac858',
    '疲劳驾驶报警(软)':'#ff7f04',
    '天线短路报警':'#84fd00'
}

function tableEmpty(arg) {
    this.el = arg
    setTimeout(() => {
        let dom = this.el.$refs.emptyBlock
        dom.style.display = "block"
    })
}